/**************************************************************************
	filename : 	src\base\os_adapter\thread\thread.h
	file path:	src\base\os_adapter\thread
	file base:	thread
	file ext :	h
	
	purpose  :	适配不同操作系统的线程处理函数。
***************************************************************************/


#ifndef _thread_h_
#define _thread_h_

#include "os.h"

/***************************************************************************
* 描述: 平台专属定义。
***************************************************************************/
#if (LIC_WINDOWS == LIC_OS)
#include <Windows.h>
#define HThread HANDLE

#elif (LIC_LINUX == LIC_OS)
#include <pthread.h>
#define HThread pthread_t

#else
#error ####################不支持的系统####################
#endif


/***************************************************************************
* 描述: 线程主函数。
***************************************************************************/
typedef ALM_VOID* (*thread_fn)(ALM_VOID* pData);

/***************************************************************************
* 描述: 启动一个新的线程。
***************************************************************************/
HThread thread_start(thread_fn threadfn, ALM_VOID* pData);

/***************************************************************************
* 描述: 等待指定线程运行结束。
***************************************************************************/
ALM_VOID thread_wait(HThread* pThread);

/************************************************************************/
/* 获取当前线程编号。
/************************************************************************/
HThread Os_ThreadGetId();

#endif // _thread_h_
